In [1]:
import pandas as pd

In [39]:
filename = "Demandeurs d’emploi inscrits en fin de mois à Pôle emploi par Sexe - La Réunion.csv"
data = pd.read_csv(filename,skiprows=3,sep=";",skipfooter=1,engine='python')
data.tail()

               Mois   Hommes   Femmes     Total
319       Août 2022   84 170   92 970   177 140
320  Septembre 2022   84 040   92 940   176 990
321    Octobre 2022   83 640   92 630   176 270
322   Novembre 2022   83 650   92 570   176 220
323   Décembre 2022   83 030   91 050   174 070

In [41]:
data[["Mois"]] = pd.DataFrame(pd.date_range(start="1-1996",end="1-2023",freq="M",name= "Mois").strftime("%m/%Y"))
data

        Mois   Hommes   Femmes     Total
0    01/1996   50 610   51 530   102 140
1    02/1996   51 510   52 160   103 670
2    03/1996   51 650   52 220   103 870
3    04/1996   52 080   52 180   104 250
4    05/1996   52 140   51 790   103 940
..       ...      ...      ...       ...
319  08/2022   84 170   92 970   177 140
320  09/2022   84 040   92 940   176 990
321  10/2022   83 640   92 630   176 270
322  11/2022   83 650   92 570   176 220
323  12/2022   83 030   91 050   174 070

[324 rows x 4 columns]

In [45]:
data.to_csv("demandeurs d'emploi par sexe proc.csv",index=False)